<?php
// 変数に値を代入し、
// その値が50より大きければ
// 「50より大きい」
// 50より小さければ
// 「50より小さい」
// 50と同値であれば
// 「50です」
// という文字列を出力してください。

// また最低限どういう値でテストすればいいか
// 確認したテスト値をコメントアウトですべて示してください。

$a = 1;
echo '$aは';
if ($a < 50) {
  echo '「50より小さい」';
} elseif ($a == 50) {
  echo '「50です」';
} else {
  echo '「50より大きい」';
}

echo "\n";

$b = 50;
echo '$bは';
if ($b < 50) {
  echo '「50より小さい」';
} elseif ($b == 50) {
  echo '「50です」';
} else {
  echo '「50より大きい」';
}

echo "\n";

$c = 500;
echo '$cは';
if ($c < 50) {
  echo '「50より小さい」';
} elseif ($c == 50) {
  echo '「50です」';
} else {
  echo '「50より大きい」';
}

// toya@Toyamac 05_if % php lesson01.php
// $aは「50より小さい」
// $bは「50です」
// $cは「50より大きい」